package ch03;

public class Operrator {

	public static void main(String[] args) {
/*		연산의 우선 순위
		증감,부호,비트,논리
		산술
		int보다 작은 타입들은 int로 형변환되어 연산됨
		연산중에 큰타입이 있으면 작은 타입은 큰타입으로 되어
		오버플로우 조심
		
		쉬프트
		비교
		논리 &
		논리 ^
		논리 |
		논리 &&
		논리 ||
		조건
		대입(=,+=,-=,*=,%=,^=,|ㅡ,<<=,>>=)
*/
	/*	항 = 피연산자 = 데이터
	단항연산자(피연산자가 한개)
		부호연산자
		증감연산자 
		비교연산자
			동등비교 ==,!=
			크기비교 <,>,<=,>=
			String 비교
			
			논리연산자(&&,||,&,|,^,|)
			
			비트연산자(<<,>>,>>>)
			
		
		논리부정연산자 !
		비트반전연산자 ~
		*/
		
		/*이항연산자 (피연산자가 두개인것)
		
		삼항연산자 (피연산자가 세개인것)
	     a>b ? a:b
		*/
		
		
	}

}
